In [1]:
'I remember {0:.3} or {0:.3%} of, the days'.format(7/67890)

'I remember 0.000103 or 0.010% of, the days'

In [6]:
"My userID is {0:06d}".format(12)

'My userID is 000012'

In [8]:
"My love number is %d" % 7

'My love number is 7'

In [9]:
'%(name)s is very cute, but her sleep time is %(time).2f' % {'name' : "layla", "time" : 1.1631212}

'layla is very cute, but her sleep time is 1.16'

In [10]:
name = 'layla'
month = 12
day = 19
f'{name}! happy birth day! today is {month} / {day}!'

'layla! happy birth day! today is 12 / 19!'

In [11]:
import re

In [13]:
text = '1234567890'
ax = re.match(pattern='\d{10}' , string=text)
ax

In [14]:
if(bool(ax)):
    print("match")
else:
    print("unmatch")

match

In [15]:
print(ax.start())
print(ax.end())
print(ax.span())
print(ax.group())

0
10
(0, 10)
1234567890

In [20]:
string_a = '123 4567 8901'
string_b = '(123) 456 7890'
string_c = '+1 (123) 456-7890'

In [17]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string=string_a)

In [18]:
re.match(pattern='\(\d{3}\)\s\d{3}\s\d{4}', string=string_b)

In [21]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string=string_c)

In [23]:
ptn = re.compile('\D{9}\:\d{4}')
ptn.match('localhost:8888')

In [24]:
def exp(x):
    return x ** 2

def exp2(x, n):
    return x ** n

In [25]:
exp(10)

100

In [27]:
exp2(10, 2)

100

In [32]:
import pandas as pd

In [34]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [35]:
df['a'].apply(exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [37]:
df['a'].apply(exp2, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [39]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [40]:
printme = lambda x : print(x)

In [44]:
df.apply(printme, axis=0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [49]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [54]:
def printx(m):
    print(m[2])

In [55]:
df.apply(printx)

30
40

a    None
b    None
dtype: object

In [72]:
df.shape[0]

3

In [73]:
def invx(m, shape):
    sum = 0
    for i in m:
        sum += i
    if(shape == 0):
        return sum / df.shape[0]
    elif(shape == 1):
        return sum / df.shape[1]

In [74]:
df.apply(invx, shape=1)

a    30.0
b    45.0
dtype: float64

In [76]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [75]:
df.apply(invx, shape=0)

a    20.0
b    30.0
dtype: float64

In [78]:
(10 + 20 + 30) / 3

20.0

In [79]:
(20 + 30 + 40) / 3

30.0

In [84]:
df.apply(invx, shape=1, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [81]:
( 10 + 20 ) / 2

15.0

In [82]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [83]:
df.apply(avg_2_apply, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [85]:
import seaborn as sns

In [86]:
df = sns.load_dataset("titanic")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [92]:
getnana = lambda x : pd.isnull(x).sum()

In [91]:
def getnan(m):
    null_vec = pd.isnull(m)
    return null_vec.sum()
df.apply(getnan)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [93]:
df.apply(getnana)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [95]:
def GetPercent(msi):
    x = pd.isnull(msi).sum()
    return x / msi.size
df.apply(GetPercent)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [96]:
def GetPercent(msi):
    x = pd.isnull(msi).sum()
    return (x / msi.size) * 100
df.apply(GetPercent)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [97]:
def nonNaNa(msi):
    x = pd.isnull(msi).sum()
    return 1 - (x / msi.size)

df.apply(nonNaNa)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [99]:
def nonNaNa(msi):
    x = pd.isnull(msi).sum()
    return (1 - (x / msi.size)) * 100

df.apply(nonNaNa)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [101]:
df.apply(nonNaNa, axis=1)

0       93.333333
1      100.000000
2       93.333333
3      100.000000
4       93.333333
          ...
886     93.333333
887    100.000000
888     86.666667
889    100.000000
890     93.333333
Length: 891, dtype: float64

In [103]:
df.apply(GetPercent, axis=1)

0       6.666667
1       0.000000
2       6.666667
3       0.000000
4       6.666667
         ...
886     6.666667
887     0.000000
888    13.333333
889     0.000000
890     6.666667
Length: 891, dtype: float64

In [104]:
getfile = lambda x : pd.isnull(x).sum()

In [106]:
df.apply(getfile, axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [110]:
df['missing'] = df.apply(getfile, axis=1)

In [111]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2